app/controllers/donors_controller.rb

SELECT "donors".* FROM "donors"
---
    def index
        @donors = Donor.all

SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT 1  [["id", 10]]
---
    def show
        @donor = Donor.find(params[:id])

SELECT  "donors".* FROM "donors" WHERE "donors"."id" = ? LIMIT 1  [["id", 1]]
---
    def edit
        @donor = Donor.find(params[:id])