app/controllers/inventories_controller.rb

SELECT  "inventories".* FROM "inventories" WHERE "inventories"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_inventory
      @inventory = Inventory.find(params[:id])