app/controllers/items_controller.rb

    def create
        @item = Item.new(item_params)

        if @item.save
---
INSERT INTO "items" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-08-02 05:58:23.343067"], ["updated_at", "2017-08-02 05:58:23.343067"]]

    def update
        @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 803]]