app/controllers/organizations_controller.rb

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", 31]]
---
    def show
        @organization = Organization.find(params[:id])

INSERT INTO "organizations" ("org_name", "address", "phone", "contact_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["org_name", "Team Fuel"], ["address", "5828 Pacific"], ["phone", "4535335402"], ["contact_id", "Jimbo"], ["created_at", "2017-08-01 03:25:51.163573"], ["updated_at", "2017-08-01 03:25:51.163573"]]
---
    def create
        @organization = Organization.new(organization_params)

        if @organization.save

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", 272]]
---
    def edit
        @organization = Organization.find(params[:id])

SELECT  "organizations".* FROM "organizations" WHERE "organizations"."id" = ? LIMIT 1  [["id", 272]]
UPDATE "organizations" SET "phone" = ?, "updated_at" = ? WHERE "organizations"."id" = ?  [["phone", "(508) 211-6897 x7729"], ["updated_at", "2017-08-04 07:33:32.724369"], ["id", 272]]
---
    def update
        @organization = Organization.find(params[:id])

        if @organization.update(organization_params)